In [94]:
import pandas as pd
import numpy as np

In [95]:
data = {'2020' : [9668465, 3391946, 2942828, 1450062],
        '2010' : [10312545, 3567910, 2758296, 1454636]}
df = pd.DataFrame(data)
df

      2020      2010
0  9668465  10312545
1  3391946   3567910
2  2942828   2758296
3  1450062   1454636

#### 1. 인덱스 설정
    1-1. 데이터의 인덱스가 '기본'인 경우 '원하는 인덱스'로 변경  
    - 데이터프레임_변수명.index = [원하는 인덱스(행의 수 동일하게)]  
---
    1-2. 데이터의 인덱스를 '설정'하여 데이터프레임 만들기
    - df = pd.DataFrame(data, index = [원하는 인덱스(행의 수 동일하게)])

In [96]:
df.index = ["서울", "부산", "인천" , "광주",]
df

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

In [97]:
df = pd.DataFrame(data, index = ["서울", "부산", "인천" , "광주"])
df

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

#### 2. 인덱스 지정하여 생성(리스트 구조 활용)
    - 데이터의 형태를 리스트로 설정하여 DataFrame에 각각 넣기
    - df2 = pd.DataFrame(데이터_리스트, index = 인덱스_리스트, columns=header_리스트)

In [98]:
data2 = [[9668465, 3391946, 2942828, 1450062],
        [10312545, 3567910, 2758296, 1454636]]
ind = [ '2020','2010']
col = ["서울", "부산", "인천" , "광주"]
df2 = pd.DataFrame(data2, index = ind, columns=col)
df2

            서울       부산       인천       광주
2020   9668465  3391946  2942828  1450062
2010  10312545  3567910  2758296  1454636

##### 2. 데이터프레임 전치(transpose)
    - 데이터프레임_변수명.T

In [99]:
df2.T

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

##### 3. Values, Index, Columns 확인하기

In [100]:
print(f"""
데이터프레임의 값 확인
{df.values}

데이터프레임의 인덱스 확인
{df.index}

데이터프레임의 컬럼 확인
{df.columns}""")

데이터프레임의 값 확인
[[ 9668465 10312545]
 [ 3391946  3567910]
 [ 2942828  2758296]
 [ 1450062  1454636]]

데이터프레임의 인덱스 확인
Index(['서울', '부산', '인천', '광주'], dtype='object')

데이터프레임의 컬럼 확인
Index(['2020', '2010'], dtype='object')

##### 4. 인덱싱
    - df["원하는_키값"] : 데이터프레임 형태X
    - df[["원하는_키값]] : 데이터프레임 형태

In [101]:
# 열 인덱스 확인하기(열 인덱싱)
df[["2020", "2010"]]

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

In [102]:
#DataFrame 행 슬라이싱
df[0:2]

       2020      2010
서울  9668465  10312545
부산  3391946   3567910

In [103]:
df['서울':'부산']

       2020      2010
서울  9668465  10312545
부산  3391946   3567910

### DataFrame 슬라이싱 -> 인덱싱
 - loc[]인덱서 : 실제 인덱스 이름을 사용하여 행을 가지고 올 때 사용
 - iloc[] 인덱서 : numpy 의 array 인덱싱 방식으로 행을 가지고 올 때 사용

In [104]:
df.loc['부산':'인천','2020':'2010']

       2020     2010
부산  3391946  3567910
인천  2942828  2758296

In [105]:
df.iloc[3]

2020    1450062
2010    1454636
Name: 광주, dtype: int64

In [106]:
# Pandas Boolean 인덱싱
df['2010']>= 2500000

서울     True
부산     True
인천     True
광주    False
Name: 2010, dtype: bool

In [107]:
df[df['2010']>= 2500000]

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296

### CSV 파일 불러오기
 - pd.read_csv('파일이름.csv', encoding='인코딩문자')

In [108]:
# csv파일 불러오기
#population = pd.read_csv('population.csv', encoding='utf-8')
#population

In [109]:
population = pd.read_csv('population.csv',encoding_errors='ignore')
population

  Unnamed: 0  Unnamed: 1     2015       2010       2005     2000
0        NaN         NaN  9904312  9631482.0  9762546.0  9853972
1          λ         NaN  3448737        NaN        NaN  3655437
2          õ         NaN  2890451  2632035.0        NaN  2466338
3          뱸         NaN  2466052  2431774.0  2456016.0  2473990

In [110]:
population=pd.read_csv('./population.csv',encoding='cp949')
population

   도시   지역     2015       2010       2005     2000
0  서울  수도권  9904312  9631482.0  9762546.0  9853972
1  부산  경상권  3448737        NaN        NaN  3655437
2  인천  수도권  2890451  2632035.0        NaN  2466338
3  대구  경상권  2466052  2431774.0  2456016.0  2473990

In [111]:
population=pd.read_csv('./population.csv',encoding='euc-kr')
population

   도시   지역     2015       2010       2005     2000
0  서울  수도권  9904312  9631482.0  9762546.0  9853972
1  부산  경상권  3448737        NaN        NaN  3655437
2  인천  수도권  2890451  2632035.0        NaN  2466338
3  대구  경상권  2466052  2431774.0  2456016.0  2473990

In [112]:
population= pd.read_csv('./population.csv',index_col='도시', encoding='euc-kr' )
population

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

### 정렬
 - sort_index 함수 : 인덱스값을 기준으로 정렬하는 방법
 - sort_value 함수 : 데이터값을 기준으로 정렬하는 방법

In [113]:
population.sort_index()

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338

In [114]:
population['2010'].sort_values()

도시
대구    2431774.0
인천    2632035.0
서울    9631482.0
부산          NaN
Name: 2010, dtype: float64

In [115]:
population['2010'].sort_values(ascending= False) #내림차순 ascending = False

도시
서울    9631482.0
인천    2632035.0
대구    2431774.0
부산          NaN
Name: 2010, dtype: float64

In [116]:
# 1. DataFrame을 2010년 인구수 기준으로 정렬해라 
population.sort_values(by= '2010')

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437

In [117]:
# 2. DataFrame을 지역, 2010년 인구수 기준으로 정렬해라.
population.sort_values(by=['지역','2010'])

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972

In [118]:
# score.csv 파일 불러오기
score=pd.read_csv('./score.csv',encoding='euc-kr',index_col='과목')
score

     1반  2반  3반  4반
과목
파이썬  45  44  73  39
DB   76  92  45  69
자바   47  92  45  69
크롤링  92  81  85  40
Web  11  79  47  26

In [119]:
# 학급별 총계 
score.sum() # sum = 각 column별로 합계

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [120]:
#학급별 점수 순위
score.sum().sort_values(ascending=False)

2반    388
3반    295
1반    271
4반    243
dtype: int64

In [121]:
#과목별 합계 구하기
score.sum(axis = 1)

과목
파이썬    201
DB     282
자바     253
크롤링    298
Web    163
dtype: int64

In [122]:
# 과목별 합계를 DataFrame에 추가하기
score['합계'] = score.sum(axis = 1)

In [123]:
score

     1반  2반  3반  4반   합계
과목
파이썬  45  44  73  39  201
DB   76  92  45  69  282
자바   47  92  45  69  253
크롤링  92  81  85  40  298
Web  11  79  47  26  163

In [124]:
# 과목별 평균을 계산하여 column에 추가하자.
score['평균']= score.loc[:,:'4반'].mean(axis=1)

In [125]:
score

     1반  2반  3반  4반   합계     평균
과목
파이썬  45  44  73  39  201  50.25
DB   76  92  45  69  282  70.50
자바   47  92  45  69  253  63.25
크롤링  92  81  85  40  298  74.50
Web  11  79  47  26  163  40.75

### max(), min() 함수

In [126]:
score.max()

1반     92.0
2반     92.0
3반     85.0
4반     69.0
합계    298.0
평균     74.5
dtype: float64

In [127]:
score.min()

1반     11.00
2반     44.00
3반     45.00
4반     26.00
합계    163.00
평균     40.75
dtype: float64

In [128]:
score.max(axis=1) # 합계가나옴..

과목
파이썬    201.0
DB     282.0
자바     253.0
크롤링    298.0
Web    163.0
dtype: float64

In [133]:
# 합계가 아닌 각 과목중 최고 점수를 뽑아내자.
maxArr = score.loc[:'Web',:'4반'].max(axis=1)
maxArr

과목
파이썬    73
DB     92
자바     92
크롤링    92
Web    79
dtype: int64

In [135]:
# 각 과목중 최저 점수를 뽑아내자.
minArr = score.loc[:'Web',:'4반'].min(axis=1)
minArr

과목
파이썬    39
DB     45
자바     45
크롤링    40
Web    11
dtype: int64

In [129]:
score.min(axis= 1)

과목
파이썬    39.0
DB     45.0
자바     45.0
크롤링    40.0
Web    11.0
dtype: float64

In [136]:
# 과목별 가장 큰 값과 작은 값의 차이를 구하시오.
maxArr - minArr

과목
파이썬    34
DB     47
자바     47
크롤링    52
Web    68
dtype: int64

In [142]:
# 마음에 안드는 열 삭제
score1 = score.drop(['4반'],axis=1)
score1

     1반  2반  3반   합계     평균
과목
파이썬  45  44  73  201  50.25
DB   76  92  45  282  70.50
자바   47  92  45  253  63.25
크롤링  92  81  85  298  74.50
Web  11  79  47  163  40.75

In [183]:
# 행 삭제
score2 = score.drop('Web')
score2

     1반  2반  3반  4반   합계     평균
과목
파이썬  45  44  73  39  201  50.25
DB   76  92  45  69  282  70.50
자바   47  92  45  69  253  63.25
크롤링  92  81  85  40  298  74.50

### df.apply(func,axis = 0 or 1)
 - 행이나 열 단위로 더 복잡한 처리를 하고 싶을 때 사용!
 - pandas의 객체에 다른 라이브러리 함수를 적용하는 방법
 - pandas 객체에 열 혹은 행에 대해 함수를 적용하는 방법

In [145]:
data_dic = {'A':[1,3,3,4,4],'B': [1,2,2,3,3],'C':[1,2,4,4,5]}
df3 = pd.DataFrame(data_dic)
df3

   A  B  C
0  1  1  1
1  3  2  2
2  3  2  4
3  4  3  4
4  4  3  5

In [146]:
df4 = df3.apply(pd.value_counts)
df4

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

### fillna 함수
 - 결측치(NaN)를 원하는 값으로 바꾸는 기능

In [147]:
df4.fillna(0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

### 카테고리 만들기

In [150]:
ages = [0,2,10,21,23,27,31,61,20,41,32,100]
bins = [0,15,25,35,60,99] # 데이터의 구간을 지정
labels = ["미성년자","청년","중년","장년","노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '노년', '청년', '장년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [151]:
type(cats)  # 범주형

pandas.core.arrays.categorical.Categorical

In [152]:
cats.categories #카테고리 범주확인

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [155]:
# 카테고리 요소를 데이터 프레임화 해서 출력
ageArr = pd.DataFrame(ages, columns=['ages'])
ageArr

    ages
0      0
1      2
2     10
3     21
4     23
5     27
6     31
7     61
8     20
9     41
10    32
11   100

In [157]:
# 각 연령에 맞게 카테고리를 추가하자
ageArr['age_cat']=cats
ageArr

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     27      중년
6     31      중년
7     61      노년
8     20      청년
9     41      장년
10    32      중년
11   100     NaN

### value_counts 함수
 - 값이 숫자,문자열,카테고리 값인 경우에 각각의 값이 나온 횟수를 세는 기능

In [159]:
# 카테고리별로 나이 개수를 확인해보자.
cats.value_counts()

미성년자    2
청년      3
중년      3
장년      1
노년      1
dtype: int64

In [160]:
ageArr['age_cat'].value_counts()

청년      3
중년      3
미성년자    2
장년      1
노년      1
Name: age_cat, dtype: int64

## DataFrame 병합

### concat함수
 - DataFrame들을 합쳐줄 때 사용하는 함수

In [163]:
df1 = pd.DataFrame({'A' : ['A0', 'A1', 'A2', 'A3'],
                    'B' : ['B0', 'B1', 'B2', 'B3'],
                    'C' : ['C0', 'C1', 'C2', 'C3'],
                    'D' : ['D0', 'D1', 'D2', 'D3']},
                   index = [0,1,2,3])

df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                    'D' : ['D4', 'D5', 'D6', 'D7']},
                   index=[4,5,6,7])

df3 = pd.DataFrame({"A" : ["A8", "A9", "A10", "A11"],
                    "B" : ["B8", "B9", "B10", "B11"],
                    "C" : ["C8", "C9", "C10", "C11"],
                    "D" : ["D8", "D9", "D10", "D11"]},
                   index = [8,9,10,11])

In [165]:
result = pd.concat([df1,df2,df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### Keys 속성 부여 시 다중 index가 된다.

In [167]:

result = pd.concat([df1,df2,df3], keys =['x','y','z'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

### 다중 index 확인

In [168]:

result.index

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [169]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

### 행 방향으로 병합하기.

In [171]:
df4 = pd.DataFrame({"B" : ["B2", "B3", "B6", "B7"],
                    "D" : ["D2", "D3", "D6", "D7"],
                    "F" : ["F2", "F3", "F6", "F7"]},
                   index = [2,3,6,7])
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [172]:
# axis = 1  : 행방향 병합
result = pd.concat([df1,df4],axis = 1)
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [175]:
# axis = 0 : 열방향 , 기본값
result = pd.concat([df1,df4],axis = 0)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

### concat 함수의 join 속성
 - Innerjoin : 겹치는 요소만 출력
 - Fulljoin(Outerjoin) : 모두 합쳐서 출력

In [176]:
# innerjoin
result = pd.concat([df1,df4],axis = 1, join = 'inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [178]:
result = pd.concat([df1,df4],axis = 0, join = 'inner')
result

    B   D
0  B0  D0
1  B1  D1
2  B2  D2
3  B3  D3
2  B2  D2
3  B3  D3
6  B6  D6
7  B7  D7

### concat함수의 ignore_index 속성
 - 기존 인덱스를 무시하고 새로운 인덱스 부여하는 기능

In [179]:
# 열방향 기존 인덱스를 무시하고 0~7로 새로 인덱싱
result = pd.concat([df1,df4], ignore_index= True)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [182]:
# 행방향 기존 인덱스를 무시하고 0~7로 새로 인덱싱
result = pd.concat([df1,df4],axis=1 ,ignore_index= True)
result

     0    1    2    3    4    5    6
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

### Concat vs Merge

In [199]:
employee = [{'empno':1, 'ename':'kim', 'dept':1},
            {'empno':2, 'ename':'lee', 'dept':2},
            {'empno':3, 'ename':'park', 'dept':1},
            {'empno':4, 'ename':'song', 'dept':3},
            {'empno':5, 'ename':'min', 'dept':2}
           ]
dept=[{'dept':1, 'deptname':'관리직'},
      {'dept':2, 'deptname':'영업직'},
      {'dept':3, 'deptname':'개발직'}
     ]
info =[{'empno':1, 'addr':'서울시','phone':'010-1111-1111'},
       {'empno':3, 'addr':'부산시','phone':'010-2222-2222'},
       {'empno':2, 'addr':'광주시','phone':'010-3333-3333'},
       {'empno':5, 'addr':'광주시','phone':'010-4444-4444'},
       {'empno':4, 'addr':'광주시','phone':'010-5555-5555'}
      ]

In [200]:
emp = pd.DataFrame(employee)
dept = pd.DataFrame(dept)
info = pd.DataFrame(info)

In [201]:
emp

   empno ename  dept
0      1   kim     1
1      2   lee     2
2      3  park     1
3      4  song     3
4      5   min     2

In [202]:
dept

   dept deptname
0     1      관리직
1     2      영업직
2     3      개발직

In [203]:
info

   empno addr          phone
0      1  서울시  010-1111-1111
1      3  부산시  010-2222-2222
2      2  광주시  010-3333-3333
3      5  광주시  010-4444-4444
4      4  광주시  010-5555-5555

### merge 
 -공통 칼럼이 존재해야 하며, 그 공통 칼럼을 기준으로 데이터프레임들을 병합시킴

In [204]:
pd.merge(emp,dept)
#공통된 dept 기준으로 병합

   empno ename  dept deptname
0      1   kim     1      관리직
1      3  park     1      관리직
2      2   lee     2      영업직
3      5   min     2      영업직
4      4  song     3      개발직

In [205]:
# 공통된 값이 두개이상일때 기준을 정해주는 on= '공통값'
pd.merge(emp,dept, on= 'dept')

   empno ename  dept deptname
0      1   kim     1      관리직
1      3  park     1      관리직
2      2   lee     2      영업직
3      5   min     2      영업직
4      4  song     3      개발직

In [206]:
pd.merge(dept,emp, on= 'dept')

   dept deptname  empno ename
0     1      관리직      1   kim
1     1      관리직      3  park
2     2      영업직      2   lee
3     2      영업직      5   min
4     3      개발직      4  song

In [207]:
# inplace=True 데이터 프레임이 실제로 바뀜
mg = pd.merge(emp,dept,on='dept')
mg.drop(columns=['dept'],inplace=True)
mg

   empno ename deptname
0      1   kim      관리직
1      3  park      관리직
2      2   lee      영업직
3      5   min      영업직
4      4  song      개발직

In [208]:
#.info 
mg1=pd.merge(mg.info, on='empno')
mg1.drop(columns=['empno'],inplace= True)
mg1

TypeError: merge() missing 1 required positional argument: 'right'

In [211]:
# concat 
# concat 은 outterjoin (full join), merge는 innerjoin
pd.concat([emp,dept])

   empno ename  dept deptname
0    1.0   kim     1      NaN
1    2.0   lee     2      NaN
2    3.0  park     1      NaN
3    4.0  song     3      NaN
4    5.0   min     2      NaN
0    NaN   NaN     1      관리직
1    NaN   NaN     2      영업직
2    NaN   NaN     3      개발직

In [210]:
pd.concat([emp,dept],axis=1)

   empno ename  dept  dept deptname
0      1   kim     1   1.0      관리직
1      2   lee     2   2.0      영업직
2      3  park     1   3.0      개발직
3      4  song     3   NaN      NaN
4      5   min     2   NaN      NaN